[
  {
    "tag": ["self-doubt", "transition", "career"],
    "emotion": "overwhelmed",
    "age_group": "20s",
    "story": "I’m quite serious with these problems recently. Mostly living and financial problem. Right, poverty is my biggest problem. It became so severe that made me think everything I did is wrong… I have essays to write, but how can essays change my situation? And I forbid myself to play any game, my mind told me that I would be more broke if I kept on playing games. I don't believe at all that I'll ever get a job.I try to find these ways out for myself, but there’s a voice in my head whispering, “It’s useless— you can’t do it, there’s no way.”"
  },
  {
    "tag": ["pressure", "career","self-doubt"],
    "emotion": "self-doubt",
    "age_group": "20s",
    "story": "I think, my anxiety basically origins from my disappointment to myself. I used to have very high expectations to myself; they are too high for me to reach. Lack of ability caused great disappointment… Also, some of the negative emotion came from all those things that I don’t want to spend my time doing. I would distract my nervous mind with something casual and cheerful. Like how I usually joke about games with you. It is my way to relax and help my brain to think about something light. I would consider my stress handling ability relatively strong. As you mentioned the identity transitional stage, I’m raise in environments that children are taught to be independent. We are very excited to step in to society, and it just felt like, sooner or later, anxiety is sure to come. When the first year ended, I almost gave up doing product design. During a summer job, I met older students who seemed confident about their future despite uncertainties. That made me reflect and realize I still want to pursue product design, even if results take time. I’m no longer in a rush or afraid of making mistakes—I just didn’t fully understand my work before. I also chose not to pursue grad school because I value financial independence and my career path aligns with my undergrad. Hearing others’ experiences has helped ease my anxiety."
  },
  {
    "tag": ["pressure", "career","self-doubt", "transition"],
    "emotion": "self-doubt",
    "age_group": "20s",
    "story": "All those uncertainties, graduation pressure, school pressure… Just too many things piled up at the same time.I used to have an internship, it was a really stressful experience. The time for everyday work is never enough, I can never figure out what the boss actually wants. So many factors that cannot be controlled and uncertain that stressed me out. It is quite different with school, and when i first entered, I was thinking… Where should I be? Do I deserve this role? Is my ability enough? All these questions. But afterall, You have to believe yourself. You will find that everyone’s ability is quite similar to each other’s."
  },
  {
    "tag": ["pressure", "career","transition"],
    "emotion": "self-doubt",
    "age_group": "20s",
    "story":""
    },
  {
    "tag": ["pressure", "career","self-doubt"],
    "emotion": "self-doubt",
    "age_group": "20s",
    "story":""
    }
]
